F15javi/Real_Time_Systems/PrSTRDv3_BusCAN_RX/STM32CubeIDE/Application/User/T5Motor.c
#include "T5Motor.h"
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"
#include "stm32f4xx_hal.h"
#include "main.h"

extern int emergency;
extern double RX;
extern double RY;
extern uint8_t alt_ok;
extern CAN_HandleTypeDef hcan1;

extern SemaphoreHandle_t xMutexEmergencies;
extern SemaphoreHandle_t xMutexBalanceComm;
extern SemaphoreHandle_t xMutexAltitudeComm;
extern uint8_t ByteReceived1, ByteReceived2[4], ByteReceived3, ByteReceived4;
#define T_TAREA5 150

void StartTask05Motor(void const * argument)
{
  /* USER CODE BEGIN StartTask05 */
  /* Infinite loop */
	TickType_t lastWakeTime;
	lastWakeTime = xTaskGetTickCount();

	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, GPIO_PIN_RESET);
  for(;;)
  {
	if(ByteReceived4 == 1){
		xSemaphoreTake( xMutexEmergencies, portMAX_DELAY);
		if(ByteReceived3)
		{

			HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_SET);
		}
		else
		{
			HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_RESET);
		}
		xSemaphoreGive( xMutexEmergencies );

		GPIO_PinState res=HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_8);

		xSemaphoreTake( xMutexAltitudeComm, portMAX_DELAY);
		if(ByteReceived1)
		{
		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, GPIO_PIN_SET);
		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, GPIO_PIN_SET);
		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, GPIO_PIN_SET);
		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, GPIO_PIN_SET);
		}
		xSemaphoreGive( xMutexAltitudeComm );

		xSemaphoreTake(xMutexBalanceComm, portMAX_DELAY);

		int16_t Rx_In = (int16_t)((ByteReceived2[0] << 8) | ByteReceived2[1]);
		int16_t Ry_In = (int16_t)((ByteReceived2[2] << 8) | ByteReceived2[3]);

		float RX = (float)Rx_In / 10.0f;
		float RY = (float)Ry_In / 10.0f;

		if(RX > 10){
		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, GPIO_PIN_SET);
		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, GPIO_PIN_RESET);

		}else if(RX < -10){
		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, GPIO_PIN_SET);
		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, GPIO_PIN_RESET);
		}else{
		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, GPIO_PIN_RESET);
		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, GPIO_PIN_RESET);
		}

		if(RY > 10){
		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, GPIO_PIN_SET);
		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, GPIO_PIN_RESET);

		}else if(RY < -10){
		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, GPIO_PIN_SET);
		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, GPIO_PIN_RESET);
		}
		else{
		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, GPIO_PIN_RESET);
		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, GPIO_PIN_RESET);
		}
		xSemaphoreGive( xMutexBalanceComm );
	}




		vTaskDelayUntil(&lastWakeTime, pdMS_TO_TICKS(T_TAREA5));
  }
  /* USER CODE END StartTask05 */
}

